[
  {
    "id": 1,
    "name": "The Kangyur (Tibetan Buddhist Canon)",
    "coords": "27.771758248796864, 88.45533538409651",
    "lng": "Tibetan",
    "l_desc": "The Kangyur is a foundational collection of Buddhist scriptures, revered across Sikkim's monasteries as a repository of the Buddha's enlightened teachings. Its name translates to \"Translated Words,\" signifying that the texts within are direct translations of the Buddha's sermons from Sanskrit into Tibetan. The compilation is meticulously organized into sections covering disciplines, perfections, tantras, and other key philosophical and spiritual topics. Often housed in a monastery's main assembly hall or a dedicated library, the complete Kangyur consists of over 100 volumes, each carefully wrapped in silk cloth. These texts are not just historical documents; they are a living tradition, used for study, meditation, and recitation by monks and scholars. The preservation and veneration of the Kangyur reflect the profound spiritual devotion and scholarly heritage of Sikkimese Buddhism. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 2,
    "name": "Arthur Foning Collection of Lepcha Manuscripts",
    "coords": "27.70855457375793, 88.6201303027122",
    "lng": "Lepcha",
    "l_desc": "This entry represents one of several collections identified during a project to preserve the endangered Lepcha language and culture. The Lepcha people, indigenous to Sikkim, have seen their language and traditions decline over the last century. This specific collection, owned by a private family, contains manuscripts written in the unique Lepcha script, which dates back to the 18th century. These fragile documents, many of which contain Buddhist and indigenous texts, are vulnerable to damage from unfavorable climatic conditions. To prevent their loss, the EAP281 project located, identified, and, in some cases, digitized these handwritten materials. A total of 40 manuscripts from various private collections were successfully digitized, with copies being deposited at the British Library and the Namgyal Institute of Tibetology, ensuring their long-term preservation and accessibility for future study. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 3,
    "name": "Encouragement of Fortune (cângbú lecot)",
    "coords": "27.662344099409676, 88.64759612248147",
    "lng": "Lepcha",
    "l_desc": "This manuscript, known as \"Encouragement of Fortune,\" is a unique, handmade Lepcha manuscript created between 1894 and 1963. Its original physical form is an oblong book composed of two stitched quires. While its scribe remains unknown, the manuscript is a significant cultural artifact as it is a text in the endangered Lepcha language. The original is privately held, making this digital file, consisting of 26 TIFF images, a critical part of its preservation. The manuscript's condition is noted as reasonable, despite some damage, and its content offers valuable insight into the literary heritage of the Lepcha people. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 4,
    "name": "Eight Goddess calculations (hlámo gyá sá tsu)",
    "coords": "27.349110386646718, 88.59300215454229",
    "lng": "Lepcha",
    "l_desc": "This manuscript, titled \"Eight Goddess calculations,\" is a handmade text of 101 pages, dating to April 14, 1925. It is written in black ink on machine-made paper with an oblong book form. The manuscript is in good condition, although its edges are slightly worn, and some pages have dirt and water stains. Unique decorations and notes in pink and blue pencil are found throughout the text, adding a visual element. Like other manuscripts from the Arthur Foning Collection, this document is held in a private family archive in Kalimpong, but has been digitized into 106 TIFF images, ensuring its preservation and providing valuable content for researchers studying Lepcha culture and religious practices. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 5,
    "name": "The legend of Cenrejú (cenrejú sá námthár)",
    "coords": "27.366802843219144, 88.6342865712722",
    "lng": "Lepcha",
    "l_desc": "This manuscript, titled \"The legend of Cenrejú,\" is a handmade text of 87 pages, written by scribe Núrshíng Lepcha. It is an oblong book with a red cloth cover and contains text in black ink on machine-made paper. The scribe's signature and a note dated to the \"thirteenth of the third year\" are found on a loose page. While its condition is reasonable, some pages are slightly torn and stained, and the manuscript is incomplete. The text is adorned with decorations in red and blue pencil throughout, adding to its unique character as a cultural artifact. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 6,
    "name": "Parkhó calculations (parkhó sa tsu)",
    "coords": "27.433326424714625, 88.27123907282333",
    "lng": "Lepcha",
    "l_desc": "This manuscript, titled \"Parkhó calculations,\" is a handmade text of 76 pages created by the scribe Núrshíng Lepcha, whose signature appears multiple times within the document. The manuscript, in an oblong book form with a hard black cloth cover, is written on machine-made paper that notably includes the printed text \"Gangtok, Sikkim, The... 19...\" on some pages. The text is in black and blue ink, with additional decorations in black ink, and red and blue pencil throughout. Despite some ink, water stains, and traces of mold, the manuscript is in good condition. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 7,
    "name": "The story of Lord Tashe (tashe sung)",
    "coords": "27.421259656350983, 88.42466708536",
    "lng": "Lepcha",
    "l_desc": "This manuscript contains the story of Lord Tashe (tashe sung), a significant narrative within the Lepcha literary tradition. It is a handmade text, likely found in a private collection in the Kalimpong region. The story itself is a valuable cultural and religious document, shedding light on the indigenous beliefs and historical legends of the Lepcha people. Its presence in this digitized archive contributes to the preservation of an endangered language and its unique literary heritage, making the narrative accessible to researchers and cultural enthusiasts globally. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 8,
    "name": "The book of Máni (máni sa cho)",
    "coords": "27.48760161523268, 88.58112616916013",
    "lng": "Lepcha",
    "l_desc": "This handmade manuscript is a comprehensive volume containing five distinct texts, including the titular \"Book of Máni,\" along with treatises on Astrology, Prayers to the Chörten, The legend of the Ants, and Funeral calculations. The scribe, Núrshíng Lepcha, signed the manuscript on two separate pages. Wrapped in a brown cloth cover and composed of 151 pages of machine-made paper, the document is in good condition despite minor signs of wear and tear such as stains and tears. It also features a unique illustration of three chörtens and additional decorations in various inks and pencils, highlighting its dual role as a scholarly and artistic work. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 9,
    "name": "Episode of Gesar's conquest of Tazik",
    "coords": "27.592984858153482, 88.47077083487423",
    "lng": "Tibetan",
    "l_desc": "This manuscript is a complete and valuable text titled Episode of Gesar's conquest of Tazik, written in the Tibetan language. It is a rare manuscript with a recorded record number and a unique identifier. Made from plant-based paper, the document is in good condition, reflecting careful preservation. The manuscript is a lightweight and rectangular work with 5 lines of text per page, spanning 273 folios, totaling 546 pages. It is a significant Buddhist text, although it lacks any illustrations. The text begins with a sacred Buddhist verse and ends with a line of blessing. According to the data, the manuscript is believed to be from the 1st century, making it an exceptionally old and historically significant artifact. Its content, though a record of a heroic episode, is considered a Buddhist subject. This rare manuscript offers a unique glimpse into ancient Tibetan literary and religious traditions. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 10,
    "name": "Tibetan Tantric Text (Gyu ki thep)",
    "coords": "27.667453568602713, 88.60419044177205",
    "lng": "Tibetan",
    "l_desc": "This is a complete and exceptionally rare manuscript, a Tibetan Buddhist tantric text known as Gyu ki thep. It's a long, rectangular volume, distinguished by its black, plant-based paper and written in Tibetan script. The scribe is identified as the great Terton Dorjee Lingpa, a revered figure who, in the 14th century, \"revealed\" hidden teachings. The manuscript's age and its unique illustration of a diagram make it invaluable for scholars and spiritual practitioners alike. With 184 folios, it is a substantial work that opens with \"Che ki gyur\" and concludes with the auspicious word \"Tashi.\" Its physical form, a pecha manuscript, is a testament to traditional Tibetan bookmaking, preserving not only sacred knowledge but also the artistry of a bygone era. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 11,
    "name": "Kar chap geyho",
    "coords": "27.88755051193336, 88.59691030277898",
    "lng": "Tibetan",
    "l_desc": "This rare and complete manuscript, titled Kar chap geyho (དཀར་ཆབ་དགེའོ།), is a significant historical document from the 11th century. It is housed at the Namgyal Institute of Tibetology in Sikkim. The text, written in the Umey script on three pages of plant-based paper, focuses on Jyotiṣa, the traditional Indian and Tibetan system of astrology. As a valuable resource for studying the historical practice of divination and astronomy, its digitization ensures its preservation and accessibility for scholars and researchers worldwide. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 12,
    "name": "Kalli rinchen pongzod lay cha shagya nyer thuk ki riu mik shug so",
    "coords": "27.29094608696449, 88.62608024076187",
    "lng": "Tibetan",
    "l_desc": "This rare and complete manuscript, titled Kalli rinchen pongzod lay cha shagya nyer thuk ki riu mik shug so, is a significant historical document from the 11th century. Housed at the Namgyal Institute of Tibetology in Sikkim, the 34-page manuscript is composed entirely of tables and numbers. Its primary subject is Jyotiṣa (Tibetan astrology and astronomy). The text is written in Tibetan script on plant-based paper and, despite its age, is in good condition. With nine lines per page and no illustrations, this manuscript serves as a valuable resource for studying the mathematical and computational aspects of Tibetan astrological traditions. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 13,
    "name": "Thimed thonsel lay za ngai tsi ki kap shug so",
    "coords": "27.683082545534443, 88.54978963372969",
    "lng": "Tibetan",
    "l_desc": "This rare and complete manuscript, titled Thimed thonsel lay za ngai tsi ki kap shug so (དྲི་མེད་དོན་གསལ་ལས་གཟའ་ལྔའི་རྩིས་ཀྱི་སྐབས་བཞུགས་སོ༎ ཤུ་བྷཾ།), is a significant historical document from the 11th century. It is housed at the Namgyal Institute of Tibetology in Sikkim. The 16-page manuscript, written in Umey script on plant-based paper, focuses on Jyotiṣa, specifically calculations related to the five planets (za nga). Notably, some sentences are written in red ink. It begins with a verse of praise and concludes with auspicious words, signifying a complete and well-preserved document. Its content provides valuable insights into Tibetan astronomical traditions and astrological practices. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 14,
    "name": "The legend of the goddess Nángse rummít",
    "coords": "27.362051586367972, 88.81303453925958",
    "lng": "Lepcha",
    "l_desc": "This handmade manuscript, titled The legend of the goddess Nángse rummít, is a significant narrative within the Lepcha literary tradition. Written by the scribe Núrshíng Lepcha and dated to 1919, it is an oblong book of 230 pages on machine-made paper, with text in multiple colored inks. The manuscript, which is in good to reasonable condition despite some stains and loose pages, also contains notes from a later copying effort by Rápdenshíng Foning in 1933. It is a valuable document that provides insight into the cultural and religious beliefs of the Lepcha people. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 15,
    "name": "Kalli rinchen bhangzoed lay tseshag sume gya then chik shug so",
    "coords": "27.23626459113761, 88.32992540965326",
    "lng": "Tibetan",
    "l_desc": "This manuscript, housed at the Namgyal Institute of Tibetology, is a Tibetan text on the subject of JyotiáąŁa (astrology). The title, which translates to a \"treasury of calculations,\" indicates that the text is a valuable and comprehensive collection of astrological data and tables. It serves as an important resource for understanding the complex mathematical and divinatory practices within Tibetan astrological traditions. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 16,
    "name": "Tsurluk dupthay tsiki cha shay gya nyer thuk ki kalli riumik shug",
    "coords": "27.486362402749094, 88.74503606556353",
    "lng": "Tibetan",
    "l_desc": "This is a Tibetan manuscript focused on JyotiáąŁa, specifically a type of astrological system known as \"Tsurluk.\" The title suggests that the text contains detailed tables (riumik) and calculations (tsiki) related to this tradition. As part of the collection at the Namgyal Institute of Tibetology, it is a key document for scholars studying the history and methodology of Tibetan astrology. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 17,
    "name": "Tsurluk duptsi ki kalpey riumik karthug chutsey shinga jhang pa shug",
    "coords": "27.62362517231138, 88.34338845795304",
    "lng": "Tibetan",
    "l_desc": "This Tibetan manuscript is a complete text on JyotiáąŁa, focusing on the \"Tsurluk\" astrological tradition. The title indicates that the document contains tables (riumik) for specific time periods, likely for calculating astrological signs and other cyclical phenomena. Housed at the Namgyal Institute of Tibetology, this manuscript is a significant resource for understanding the detailed and precise nature of Tibetan astronomical calculations. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  },
  {
    "id": 18,
    "name": "Thaksume kangzin thang shinyi thalthak ki kalpi riumik nyingmey nyenlong la tenpa namthak shug",
    "coords": "27.885344185084932, 88.68966024584098",
    "lng": "Tibetan",
    "l_desc": "This is a Tibetan astrological manuscript on the subject of JyotiáąŁa, specifically a text of tables (riumik) from the Nyingma tradition, the oldest school of Tibetan Buddhism. The title suggests it contains calculations related to a practice called \"Thaksume.\" This manuscript, housed at the Namgyal Institute of Tibetology, is a valuable resource for studying the unique astrological and divinatory systems passed down within the Nyingma lineage. For more information and to access additional sources, visit: https://eap.bl.uk/collection/EAP281-1/search"
  }
]
