[
  {
    "id": 1,
    "name": "Sikkim Darjeeling Tour and Travels",
    "coords": "27.34086986028931, 88.61418786800982",
    "map_url": "https://maps.app.goo.gl/GPauEWZoBL34tihc9",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1758590816732!6m8!1m7!1sUMo-TOHM-iSLdmgFvGAP9Q!2m2!1d27.31927523431581!2d88.60826190815571!3f229.49185524114006!4f0.9753440507508202!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Sikkim Darjeeling Tour and Travels is a premier agency dedicated to curating unforgettable travel experiences across the breathtaking landscapes of Sikkim and Darjeeling. Specializing in a wide range of packages, the company caters to all types of travelers, including families, honeymooners, and solo adventurers. They are known for their meticulously planned itineraries that seamlessly blend popular tourist spots with off-the-beaten-path destinations, ensuring a unique and immersive journey. Beyond standard tours, they also offer specialized services like hotel bookings, reliable car rentals with experienced local drivers, and personalized trip planning to meet individual preferences and budgets. With a strong focus on customer satisfaction, their dedicated team provides prompt, transparent, and supportive service from the initial booking to the completion of your trip, ensuring a hassle-free and enriching holiday.",
    "booking": "https://sikkimdarjeelingtourism.com/"
  },
  {
    "id": 2,
    "name": "New Srijana Tours & Travels",
    "coords": "27.346075458408823, 88.6080217549819",
    "map_url": "https://maps.app.goo.gl/k8HtYC1SkJRQu9X96",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757395623499!6m8!1m7!1sei3Jln51FuT4hqi-M7v5Jg!2m2!1d27.3459653299994!2d88.60746454890828!3f143.61857842777!4f2.9531050536534735!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "New Srijana Tours & Travels, based in the heart of Gangtok, is a premier travel agency dedicated to crafting unforgettable adventures throughout the Himalayas. Specializing in customized itineraries, they offer a wide range of services from thrilling mountain bike rentals to comfortable car-based tours. Their local team is committed to providing seamless travel experiences, ensuring visitors can bypass intermediaries and book directly with passionate experts who deeply understand the enchanting beauty and rich culture of Sikkim. With a focus on personalized service, they cater to diverse preferences and budgets, whether for solo explorers, families, or groups. From historic monastery circuits to high-altitude treks, New Srijana Tours & Travels serves as a gateway to discovering both popular attractions and hidden gems, making every journey an enriching and memorable experience.",
    "booking": "https://newsrijanatours.co.in/"
  },
  {
    "id": 3,
    "name": "Adarsh Tours, Treks and Expedition",
    "coords": "27.331955974454758, 88.61361369156847",
    "map_url": "https://maps.app.goo.gl/5eabbHDuafzxFBfd8",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757395970899!6m8!1m7!1sTiz9d2e4mWZ2xNb71qIdzA!2m2!1d27.33201675288306!2d88.61431025840353!3f292.54328087585196!4f-0.21900590133640208!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Adarsh Tours, Treks and Expedition is a leading Nepali travel and tour operator, offering a comprehensive range of adventure services across the Himalayas. With a team of highly experienced guides and support staff, they specialize in crafting bespoke trekking and expedition packages to suit various skill levels, from classic treks to Mount Everest Base Camp to more challenging high-altitude climbs. Beyond trekking, their offerings extend to cultural tours, jungle safaris, and vehicle rentals, providing a complete travel solution for exploring Nepal's rich heritage and natural landscapes. Committed to responsible tourism, Adarsh Tours emphasizes sustainable practices and the well-being of local communities. Their personalized approach ensures that every client receives a unique itinerary tailored to their interests, promising an authentic and memorable journey through the breathtaking beauty of Nepal.",
    "booking": "https://www.adarshtours.com/"
  },
  {
    "id": 4,
    "name": "Fab Cab Tours & Travels",
    "coords": "27.330751388729276, 88.61321334995444",
    "map_url": "https://maps.app.goo.gl/c2LAPyaKRow97qu57",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757396912217!6m8!1m7!1sTy8M4sJZ3FknFSCmRx8EZQ!2m2!1d27.33051787442618!2d88.61293440022783!3f87.58728916767399!4f2.383941909962431!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Fab Cab Tours & Travels is a reputable tour and travel agency based in Gangtok, specializing in providing comfortable and customized travel solutions throughout Sikkim and the surrounding regions. With a focus on client satisfaction, they offer a wide array of services including car rentals, guided tours, and tailored holiday packages. Their fleet of well-maintained vehicles and a team of professional drivers ensure a safe and smooth journey, whether it's for a relaxed sightseeing trip or an adventurous mountain excursion. Fab Cab is known for its flexible itineraries, allowing visitors to design their travel plans according to their interests and schedule. From monastery tours to scenic drives through picturesque valleys, they cater to diverse travel needs, making it a go-to choice for individuals and families seeking a seamless and enjoyable experience of Sikkim's unique landscapes and cultural heritage.",
    "booking": "https://www.fabcab.co.in/"
  },
  {
    "id": 5,
    "name": "Sikkim Tamu Tour and Travels",
    "coords": "27.33811750807187, 88.61402505213164",
    "map_url": "https://maps.app.goo.gl/74A4HWz8vW3V5Qx89",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757397110751!6m8!1m7!1sL_PzBEj9pdiCYNaprN63PA!2m2!1d27.33775300135617!2d88.6151941627944!3f312.7162757263599!4f-0.4991358371526786!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Sikkim Tamu Tour and Travels is a reputable travel agency based in Gangtok, specializing in providing authentic and culturally immersive journeys throughout Sikkim. With a deep understanding of the region's diverse landscapes and traditions, they excel in crafting personalized itineraries that go beyond conventional sightseeing. Their services include guided tours to revered monasteries, trekking adventures through verdant valleys, and cultural excursions that offer a glimpse into the local way of life. Committed to sustainable and responsible tourism, they ensure their tours benefit local communities and preserve the natural environment. Whether it's a family vacation, a solo adventure, or a group trip, Sikkim Tamu Tour and Travels focuses on providing a seamless and memorable experience, with a team of knowledgeable guides who share their passion and insights, making every journey a true exploration of Sikkim's unique charm and heritage",
    "booking": "https://www.tamutourandtreks.com/"
  },
  {
    "id": 6,
    "name": "Hill Scenic Tours And Travels",
    "coords": "27.340890305386086, 88.60778092669287",
    "map_url": "https://maps.app.goo.gl/aHN63vWtRkC8SB8D9",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757397349199!6m8!1m7!1si-F9o1lwdIVWYlfRIWMf1w!2m2!1d27.34090395854671!2d88.60795190762005!3f334.9278706304177!4f-17.20525986437849!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Hill Scenic Tours and Travels is a highly-regarded tour agency based in Gangtok, specializing in curating unforgettable journeys throughout the picturesque landscapes of Sikkim. With a keen focus on providing personalized and well-organized travel solutions, they offer a diverse range of services, including car rentals, pre-planned holiday packages, and customized itineraries. Their team of experienced professionals is dedicated to ensuring a seamless and comfortable travel experience, from navigating winding mountain roads to arranging accommodations. They cater to a variety of travelers, from adventure seekers eager to trek through pristine valleys to families looking for a relaxing sightseeing tour of monasteries and scenic viewpoints. Hill Scenic Tours and Travels is committed to showcasing the natural beauty and rich cultural heritage of Sikkim, making it a reliable choice for anyone seeking a comprehensive and enchanting exploration of this Himalayan state.",
    "booking": "https://www.hillscenic.co.in/"
  },
  {
    "id": 7,
    "name": "Happiness Tours & Travels",
    "coords": "27.35719180146028, 88.61845147341208",
    "map_url": "https://maps.app.goo.gl/GtaLYXMGkJstiran6",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757397572420!6m8!1m7!1sbQJxNL8eEsKS6Cs5BP3dMQ!2m2!1d27.35705363215256!2d88.61848365991898!3f34.3856818760756!4f-7.026203512156414!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Happiness Tours & Travels is a reputable tour agency located in Gangtok, dedicated to crafting delightful and hassle-free travel experiences throughout Sikkim. With a philosophy centered on customer satisfaction, they offer a wide array of services, including custom tour packages, car rentals, and specialized itineraries for families, couples, and groups. Their team of knowledgeable local experts works meticulously to ensure every detail of the journey is well-planned, from comfortable accommodations to seamless transportation and engaging activities. They specialize in showcasing the natural beauty and vibrant culture of the region, arranging tours to sacred monasteries, breathtaking viewpoints, and serene landscapes. Happiness Tours & Travels is committed to providing a personalized service that caters to individual preferences and budgets, ensuring every traveler leaves with a heart full of cherished memories from their time in Sikkim.",
    "booking": "https://happinesstourstravels.com/"
  },
  {
    "id": 8,
    "name": "Best Travel Agent in Gangtok , Sikkim-Jeepa Travels",
    "coords": "27.311536623623642, 88.60779464812084",
    "map_url": "https://maps.app.goo.gl/Nq3ucvrLUNgnzG9H6",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757398136948!6m8!1m7!1sYpGGIsjm7OnPXjqUI3YhuA!2m2!1d27.30903899210875!2d88.60539138893775!3f148.66310755714778!4f-0.07087810819096774!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Best Travel Agent in Gangtok, Sikkim-Jeepa Travels is a registered and highly-regarded local tour agency that specializes in providing authentic and personalized travel experiences across Sikkim and Darjeeling. Run by a local with extensive guiding experience, the company is dedicated to offering a wide range of services, including tailor-made tour packages, adventure treks, jeep safaris, and cultural excursions. They are known for their commitment to providing high-quality, eco-friendly, and value-for-money services, ensuring that every traveler's needs are met with a friendly and professional approach. With a deep understanding of the region, their team of experts works tirelessly to create itineraries that showcase the breathtaking landscapes and unique culture of the Himalayas, promising a safe, comfortable, and truly memorable journey for all their clients.",
    "booking": "https://jeepatravelsikkim.com/"
  },
  {
    "id": 9,
    "name": "SIKKIM TRAVELs EXPERTs co.",
    "coords": "27.300604703207235, 88.23582493985813",
    "map_url": "https://maps.app.goo.gl/twA6aEWxaGrUxxZL8",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757398338350!6m8!1m7!1sWh1i_45KqUfsBAahlnbSZg!2m2!1d27.30072387534938!2d88.23618972026985!3f132.3626661013663!4f-11.262682372413124!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Sikkim Travels Experts Co. is a highly specialized tour operator dedicated to providing exceptional travel experiences across the Himalayan state of Sikkim. With a team of knowledgeable local experts, they excel in crafting comprehensive and personalized itineraries that cater to a wide range of interests, from adventure treks to cultural tours and spiritual pilgrimages. The company prides itself on its deep understanding of the region's diverse geography and rich traditions, ensuring that every journey is not only seamless but also deeply enriching. They offer a full suite of services, including custom holiday packages, comfortable vehicle rentals, and arrangements for accommodations, all designed to meet the specific needs and preferences of their clients. Committed to responsible tourism, Sikkim Travels Experts Co. ensures that their tours are sustainable and supportive of local communities, making them a reliable choice for travelers seeking an authentic and unforgettable exploration of this magnificent region.",
    "booking": ""
  },
  {
    "id": 11,
    "name": "Norbulingka Tours & Travels",
    "coords": "27.32194115358234, 88.6078598163513",
    "map_url": "https://maps.app.goo.gl/xts3ajppRvTsgLrSA",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757398718010!6m8!1m7!1sSPi5mfwQVLjFkLoK18Deqg!2m2!1d27.32168036066717!2d88.6072519859882!3f232.5103641465667!4f0.24047663351478832!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Norbulingka Tours & Travels is a reputable travel agency based in Gangtok, specializing in providing unique and authentic travel experiences across Sikkim and the surrounding regions. With a deep respect for the local culture and environment, they craft customized itineraries that go beyond standard sightseeing, offering a genuine glimpse into the life and traditions of the Himalayas. Their services include guided tours to sacred monasteries, thrilling trekking expeditions, and cultural excursions that connect travelers with local communities. The company is committed to sustainable tourism practices, ensuring their operations benefit the local economy and preserve the natural beauty of the region. Norbulingka's team of experienced professionals provides personalized service, from comfortable transportation to well-planned accommodations, promising a safe, enriching, and truly memorable journey for every traveler exploring the enchanting landscapes of Sikkim.",
    "booking": "https://profile.hellotravel.com/norbulingka-tours-and-travel"
  },
  {
    "id": 13,
    "name": "Yak and Yeti Travels and Expeditions",
    "coords": "27.33635243253445, 88.61501385683103",
    "map_url": "https://maps.app.goo.gl/Va87Fpataq2J72as9",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757399194650!6m8!1m7!1sdNw9job37WKNHitUlrEJhg!2m2!1d27.33634693468258!2d88.61426975580308!3f213.28371397885448!4f0.5585780331471426!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Yak and Yeti Travels and Expeditions is a premier travel and adventure company based in Nepal, renowned for its expertise in organizing high-quality trekking and mountaineering expeditions. With a team of highly experienced Sherpas and guides, they specialize in crafting unforgettable journeys to some of the world's most iconic peaks, including Mount Everest, Annapurna, and other Himalayan ranges. Beyond trekking and climbing, they also offer a wide array of services such as cultural tours, jungle safaris, and vehicle rentals, providing a complete solution for exploring Nepal's diverse landscapes and rich heritage. Committed to safety and sustainable tourism, Yak and Yeti ensures that every trip is meticulously planned and executed, providing clients with a safe, comfortable, and deeply authentic experience. Their personalized service and profound local knowledge make them a top choice for adventurers seeking to explore the breathtaking beauty of Nepal.",
    "booking": "https://yaknyetitravels.com/"
  },
  {
    "id": 14,
    "name": "Mountain Tours & Treks (Yuksom)",
    "coords": "27.367624379753416, 88.22273978697527",
    "map_url": "https://maps.app.goo.gl/XCb9xfxCd1m6kGNt7",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757399618560!6m8!1m7!1sbgXKP4-f7u0SsVo6ofBmZQ!2m2!1d27.3677842397118!2d88.22208683164631!3f359.65764910887145!4f0.8954185560911156!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Mountain Tours & Treks is a highly-regarded travel agency based in Yuksom, Sikkim, specializing in providing authentic and personalized tours and treks across the state. With a deep focus on showcasing the natural beauty and cultural heritage of West Sikkim, they offer a wide range of services, from short village walks to challenging high-altitude treks. Their expertise lies in organizing expeditions to revered trails, including the Goechala Trek and treks to Dzongri, and arranging culturally enriching tours to ancient monasteries and local villages. The company prides itself on its knowledgeable local guides who share a profound understanding of the region's geography, flora, and fauna. Committed to sustainable tourism, Mountain Tours & Treks ensures that their activities have a minimal environmental impact while providing an immersive and unforgettable experience for all travelers.",
    "booking": "https://www.trekkinginsikkims.com/"
  },
  {
    "id": 15,
    "name": "Glacier Treks & Adventure",
    "coords": "27.367275264782823, 88.22284010340654",
    "map_url": "https://maps.app.goo.gl/YLRT1WQaipjHi7W56",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757399759091!6m8!1m7!1sRObqCGiguQI7XUqswT04Ag!2m2!1d27.36710182727671!2d88.22267384314819!3f322.5312192612969!4f3.953575115690242!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Glacier Treks & Adventure is a premier adventure travel company based in Gangtok, specializing in organizing thrilling and authentic treks and expeditions across the Himalayas. With a team of highly experienced guides and support staff, they cater to both seasoned trekkers and beginners, offering a diverse range of itineraries, from classic treks to more challenging high-altitude routes. Their services extend beyond trekking to include cultural tours, mountain biking, and customized adventure packages, all designed to showcase the stunning landscapes and rich culture of Sikkim. Committed to safety and sustainable tourism, Glacier Treks & Adventure ensures that every journey is well-planned and executed, with a focus on providing a seamless and memorable experience. They are known for their personalized service, catering to the unique interests and fitness levels of their clients, making them a trusted choice for anyone seeking an exhilarating exploration of the Eastern Himalayas.",
    "booking": "https://trekinsikkim.in/"
  },
  {
    "id": 17,
    "name": "Sikkim Trekking And Travel Services Pvt Ltd",
    "coords": "27.36168630925765, 88.67190747796978",
    "map_url": "https://maps.app.goo.gl/kabhg5amLXLHzCKbA",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757400026002!6m8!1m7!1sG5kC5BQ4nob0KCAqevZnYg!2m2!1d27.3323712850402!2d88.61692480352026!3f284.0457015137674!4f-7.489860477610293!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Sikkim Trekking and Travel Services Pvt Ltd, a pioneer in Sikkim's tourism industry, has been at the forefront of Himalayan adventure since its inception in 1978. Renowned for its historical role in establishing trekking routes and promoting sustainable tourism, the company holds the distinction of organizing the first-ever trek for the prestigious Italian Alpine Club. With decades of unparalleled experience, they have honed their expertise in crafting authentic and immersive journeys through the region's breathtaking landscapes. The company, now operating under the brand \"Roam Beyond,\" continues its legacy of excellence by offering a diverse range of services, including high-altitude treks, cultural tours, and curated expeditions not only in Sikkim but also in Bhutan and the northeastern states of India. Their commitment to responsible travel and their profound local knowledge ensures that every client receives a personalized, safe, and deeply enriching experience, making them a trusted name for adventurers seeking to explore the heart of the Eastern Himalayas.",
    "booking": "https://www.justdial.com/Gangtok/Sikkim-Trekking-And-Travel-Services-Pvt-Ltd-Gangtok-Sikkim/9999P3592-3592-101018182900-B7N3_BZDET"
  },
  {
    "id": 19,
    "name": "Yangthang Group of Hotels",
    "coords": "27.326984650593133, 88.61892031966332",
    "map_url": "https://maps.app.goo.gl/Sxtj81cQ414YQxQG8",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757400594844!6m8!1m7!1smek7pYHpxeEHH_ZxYH_vAw!2m2!1d27.32816655151204!2d88.6117963727991!3f208.2335463278747!4f0.22542104070377889!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Yangthang Heritage is a four-star hotel located in the heart of Gangtok, offering a luxurious stay that beautifully merges traditional Sikkimese architecture with modern comforts. Situated just a short walk from the vibrant MG Marg, the hotel provides guests with breathtaking, uninterrupted views of Mount Kanchenjunga and the surrounding valleys from its spacious rooms and suites. Each room is meticulously designed with a blend of local decor and contemporary amenities, including a fireplace and fast internet. The hotel's commitment to hospitality is evident in its attentive staff, personalized services, and a multi-cuisine restaurant that serves both global and local flavors. With facilities such as a bar, spa, and a well-equipped banquet hall, Yangthang Heritage is a prime choice for travelers seeking a serene and culturally rich experience in Sikkim.",
    "booking": "https://www.yangthangheritage.com/"
  },
  {
    "id": 20,
    "name": "Temi Tea Garden",
    "coords": "27.23347209277039, 88.42280475917333",
    "map_url": "https://maps.app.goo.gl/ZW4GGswCoqV4jHCB6",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757400722237!6m8!1m7!1sCAoSFkNJSE0wb2dLRUlDQWdJREVrOVdzTEE.!2m2!1d27.23361018133102!2d88.41764830804779!3f132.64698976019892!4f-0.8600043428409094!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "The Temi Tea Garden, established in 1969, is the only tea estate in the state of Sikkim, nestled on the gentle slopes originating from the Tendong Hill. This sprawling 440-acre estate is celebrated for producing some of the finest organic teas in the world, which command high prices at international tea auctions. The garden's serene environment, coupled with the backdrop of the majestic Mount Kanchenjunga, makes it a picturesque destination. Visitors can explore the lush plantations, witness the tea processing methods in the factory, and stroll along pathways lined with cherry blossom trees that bloom in a beautiful pink mist during autumn. Committed to sustainable practices, the garden has been certified as 100% organic, using bio-fertilizers and eco-friendly methods. Temi Tea Garden offers a unique and tranquil experience, blending the natural beauty of the Himalayas with the rich aroma and flavor of its celebrated tea.",
    "booking": "https://sikkimdarjeelingtourism.com/temi-tea-garden/"
  },
  {
    "id": 22,
    "name": "The Fern Denzong Hotel & Spa, Gangtok",
    "coords": "27.326100036958685, 88.61447993299667",
    "map_url": "https://maps.app.goo.gl/d8Ya1BnBjdVvFW6j9",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757400972068!6m8!1m7!1sAsY1CSIhUSYXrD-LnW2rJw!2m2!1d27.32606372208124!2d88.61328965472093!3f206.9131279433219!4f10.757931705176205!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "The Fern Denzong Hotel & Spa is a four-star luxury hotel conveniently located on Kazi Road, a short stroll from Gangtok's popular MG Marg. As the name suggests, the hotel provides an excellent blend of comfort and wellness, with 70 well-appointed rooms that offer a choice between stunning city views and breathtaking panoramas of the Kanchenjunga mountain range. Guests can indulge in a multi-cuisine dining experience at the \"Hot Flavours\" restaurant or relax at the on-site bar. The hotel's full-service spa, along with a well-equipped fitness center, provides an ideal retreat for relaxation. With amenities such as free WiFi, a 24-hour front desk, and a travel desk, The Fern Denzong Hotel & Spa is committed to providing a seamless and memorable stay for travelers seeking a comfortable and elegant base to explore the beauty of Gangtok.",
    "booking": "https://www.fernhotels.com/hills-mountains/the-fern-denzong-hotel-spa-gangtok"
  },
  {
    "id": 23,
    "name": "Hotel Royal Gangtok",
    "coords": "27.368462242977486, 88.61567510471166",
    "map_url": "https://maps.app.goo.gl/fKihLks7NhxpainJ6",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757401174731!6m8!1m7!1sEF_K6CQ9xJH0y8KB-ljSpw!2m2!1d27.3676305550342!2d88.61419596732975!3f184.70040652499125!4f-7.854165896646492!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Hotel Royal Gangtok is a charming 3-star hotel situated in the tranquil surroundings of Bojoghari, offering a peaceful retreat just a short drive from the bustling MG Marg. As part of the Apsara Group Hotels, it is known for its commitment to providing a pure-vegetarian dining experience, with a restaurant that also caters to Jain food requests. The hotel provides a variety of well-appointed rooms, some of which offer stunning valley views. Guests can enjoy a range of amenities, including a 24-hour front desk, room service, free WiFi, and parking. With a focus on friendly service and a comfortable, clean environment, Hotel Royal Gangtok is a popular choice for families and travelers seeking a quiet and spiritual atmosphere in the heart of Sikkim.",
    "booking": "https://www.apsaragrouphotels.in/hoteldetails.aspx?pid=1"
  },
  {
    "id": 24,
    "name": "Sikkim NH10 Tours & Travels",
    "coords": "27.332504597105995, 88.6148709740229",
    "map_url": "https://maps.app.goo.gl/syQiQMK2Z3sTeTDg9",
    "embed_link": "<iframe src=\"https://www.google.com/maps/embed?pb=!4v1757401330580!6m8!1m7!1spbDkkmlQxCCDI2KLUqXUXA!2m2!1d27.33227230218088!2d88.61453206468589!3f227.34056648281575!4f-11.928921577178315!5f0.7820865974627469\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>",
    "l_desc": "Sikkim NH10 Tours & Travels is a reputable tourism company based in Gangtok, specializing in crafting exceptional and budget-friendly tour packages for the breathtaking regions of Sikkim and Darjeeling. With a commitment to customer satisfaction, the company is managed by a team of professionals passionate about travel, who meticulously design itineraries to suit diverse preferences. Their comprehensive services go beyond just arranging tours; they handle everything from hotel bookings and cab rentals to personalized trip planning. Known for their reliability and professional approach, Sikkim NH10 Tours & Travels ensures that every journey is safe, comfortable, and truly memorable. The company's expertise in the Eastern Himalayan region, including popular destinations like Gangtok, Darjeeling, and Dooars, makes them a trusted partner for travelers looking to explore the natural wonders and rich culture of this part of India.",
    "booking": "https://www.sikkimnh10.com/"
  }
]